test/bench/evidence/20260712-1946-fe0577d42/e_write_fsync64-linux-r3.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.303739] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=1 fsync=64 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1)
p9write: (groupid=0, jobs=1): err= 0: pid=100: Sun Jul 12 19:58:28 2026
  write: IOPS=522, BW=523MiB/s (548MB/s)(1024MiB/1958msec); 0 zone resets
    clat (usec): min=58, max=1303, avg=302.31, stdev=201.83
     lat (usec): min=67, max=1353, avg=329.49, stdev=206.88
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   64], 10.00th=[   85], 20.00th=[  118],
     | 30.00th=[  149], 40.00th=[  188], 50.00th=[  255], 60.00th=[  330],
     | 70.00th=[  408], 80.00th=[  482], 90.00th=[  570], 95.00th=[  668],
     | 99.00th=[  865], 99.50th=[  947], 99.90th=[ 1172], 99.95th=[ 1303],
     | 99.99th=[ 1303]
   bw (  KiB/s): min=523241, max=655360, per=100.00%, avg=567629.67, stdev=75978.50, samples=3
   iops        : min=  510, max=  640, avg=554.00, stdev=74.48, samples=3
  lat (usec)   : 100=14.65%, 250=33.59%, 500=33.79%, 750=14.84%, 1000=2.83%
  lat (msec)   : 2=0.29%
  fsync/fdatasync/sync_file_range:
    sync (msec): min=67, max=114, avg=100.01, stdev=14.91
    sync percentiles (msec):
     |  1.00th=[   68],  5.00th=[   68], 10.00th=[   74], 20.00th=[   77],
     | 30.00th=[  101], 40.00th=[  104], 50.00th=[  107], 60.00th=[  108],
     | 70.00th=[  109], 80.00th=[  109], 90.00th=[  112], 95.00th=[  114],
     | 99.00th=[  114], 99.50th=[  114], 99.90th=[  114], 99.95th=[  114],
     | 99.99th=[  114]
  cpu          : usr=1.99%, sys=15.53%, ctx=208, majf=0, minf=0
  IO depths    : 1=101.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,15 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=523MiB/s (548MB/s), 523MiB/s-523MiB/s (548MB/s-548MB/s), io=1024MiB (1074MB), run=1958-1958msec
P9DONE write
P9ALLDONE
[    3.128826] reboot: Power down